Revit 2024 API
ConduitSizeIterator.GetCurrent Method
 Returns the current ConduitSize.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public ConduitSize GetCurrent()
Visual Basic
Public Function GetCurrent As ConduitSize
Visual C++
public:
ConduitSize^ GetCurrent()
Return Value
 The current ConduitSize.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  There is no current item in the iterator.
See Also
ConduitSizeIterator Class
Autodesk.Revit.DB.Electrical Namespace